---
type: AnalysisDisplayStyle
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 26
tags: [revit-api, class]
---

# AnalysisDisplayStyle

`Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle` · Revit 2024 · 26 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CreateAnalysisDisplayStyle | — | `` |
| Method | FindByName | 2011 | `public static ElementId FindByName ( Document document , string name )` |
| Method | GetColorSettings | 2011 | `public AnalysisDisplayColorSettings GetColorSettings ()` |
| Method | GetColoredSurfaceSettings | 2011 | `public AnalysisDisplayColoredSurfaceSettings GetColoredSurfaceSettings ()` |
| Method | GetDeformedShapeSettings | 2013 | `public AnalysisDisplayDeformedShapeSettings GetDeformedShapeSettings ()` |
| Method | GetDiagramSettings | 2012 | `public AnalysisDisplayDiagramSettings GetDiagramSettings ()` |
| Method | GetElements | 2011 | `public static ICollection < ElementId > GetElements ( Document document )` |
| Method | GetLegendSettings | 2011 | `public AnalysisDisplayLegendSettings GetLegendSettings ()` |
| Method | GetMarkersAndTextSettings | 2011 | `public AnalysisDisplayMarkersAndTextSettings GetMarkersAndTextSettings ()` |
| Method | GetVectorSettings | 2012 | `public AnalysisDisplayVectorSettings GetVectorSettings ()` |
| Method | HasColoredSurfaceSettings | 2012 | `public bool HasColoredSurfaceSettings ()` |
| Method | HasDeformedShapeSettings | 2013 | `public bool HasDeformedShapeSettings ()` |
| Method | HasDiagramSettings | 2012 | `public bool HasDiagramSettings ()` |
| Method | HasMarkersAndTextSettings | 2012 | `public bool HasMarkersAndTextSettings ()` |
| Method | HasVectorSettings | 2012 | `public bool HasVectorSettings ()` |
| Method | IsNameUnique | 2011 | `public static bool IsNameUnique ( Document document , string name , AnalysisDisplayStyle excludedElement )` |
| Method | IsTextTypeIdValid | 2011 | `public static bool IsTextTypeIdValid ( ElementId textTypeId , Document doc )` |
| Method | SetColorSettings | 2011 | `public void SetColorSettings ( AnalysisDisplayColorSettings colorSettings )` |
| Method | SetColoredSurfaceSettings | 2011 | `public void SetColoredSurfaceSettings ( AnalysisDisplayColoredSurfaceSettings coloredSurfaceSettings )` |
| Method | SetDeformedShapeSettings | 2013 | `public void SetDeformedShapeSettings ( AnalysisDisplayDeformedShapeSettings deformedShapeSettings )` |
| Method | SetDiagramSettings | 2012 | `public void SetDiagramSettings ( AnalysisDisplayDiagramSettings diagramSettings )` |
| Method | SetLegendSettings | 2011 | `public void SetLegendSettings ( AnalysisDisplayLegendSettings legendSettings )` |
| Method | SetMarkersAndTextSettings | 2011 | `public void SetMarkersAndTextSettings ( AnalysisDisplayMarkersAndTextSettings markersAndTextSettings )` |
| Method | SetName | 2011 | `public void SetName ( string name )` |
| Method | SetVectorSettings | 2012 | `public void SetVectorSettings ( AnalysisDisplayVectorSettings vectorSettings )` |
| Property | Parameter | — | `` |